Tekla Open API Reference for Tekla Structures 2025
ClosedGraphicObject.ClosedGraphicObjectAttributes.BehindModelObjects Property
 Gets or sets whether the closed graphic object is drawn behind model objects
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool BehindModelObjects { get; set; }
Public Property BehindModelObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ClosedGraphicObject.ClosedGraphicObjectAttributes Class
Tekla.Structures.Drawing Namespace